## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/masked_appstore_metrics_ecs"
      + name           = "EcsTaskError-masked_appstore_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-masked_appstore_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS masked_appstore_metrics task"
      + alarm_name                            = "EcsTaskError-masked_appstore_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-masked_appstore_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.masked_inapp_metrics.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/masked_inapp_metrics_ecs"
      + name           = "EcsTaskError-masked_inapp_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-masked_inapp_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS masked_inapp_metrics task"
      + alarm_name                            = "EcsTaskError-masked_inapp_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-masked_inapp_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/masked_server_metrics_ecs"
      + name           = "EcsTaskError-masked_server_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-masked_server_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS masked_server_metrics task"
      + alarm_name                            = "EcsTaskError-masked_server_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-masked_server_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/unmasked_appstore_metrics_ecs"
      + name           = "EcsTaskError-unmasked_appstore_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-unmasked_appstore_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS unmasked_appstore_metrics task"
      + alarm_name                            = "EcsTaskError-unmasked_appstore_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-unmasked_appstore_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/unmasked_inapp_metrics_ecs"
      + name           = "EcsTaskError-unmasked_inapp_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-unmasked_inapp_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS unmasked_inapp_metrics task"
      + alarm_name                            = "EcsTaskError-unmasked_inapp_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-unmasked_inapp_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/unmasked_server_metrics_ecs"
      + name           = "EcsTaskError-unmasked_server_metrics"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-unmasked_server_metrics"
          + namespace = "CovidShieldMetrics"
          + value     = "1"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_metric_alarm.ecs_task_error_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_error_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This monitors for errors in the ECS unmasked_server_metrics task"
      + alarm_name                            = "EcsTaskError-unmasked_server_metrics"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EcsTaskError-unmasked_server_metrics"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>